package com.example.android

object Data {

    public val objects: Array<Sport> = arrayOf(
        Sport("Бег", "Бежать на месте", R.drawable.run),
        Sport("Флаг", "Сначала попробуйте держать корпус близко к вертикальному положению, нежели горизонтальному, высоко подняв ноги, почти как в стойке на руках с расправленными в разные стороны ногами. Кстати, стойка на руках – отличный способ тренировки для освоения флага.", R.drawable.flag),
        Sport("Боковая планка","Боковую планку можно делать в нескольких вариациях. Неподготовленные могут начать со стойки на коленях, следующим этапом будет классический вариант. Усложняют тренировку делая стойку на прямой руке, добавляя вращения корпуса. Для продвинутых подойдут варианты с использованием спортивного инвентаря.", R.drawable.bokplank),
        Sport("Отжимания","Отжима́ния — базовое физическое упражнение, выполняемое в планке и представляющее собой опускание-поднятие тела с помощью рук от пола (предпочтительно), скамьи, стула, стола, стены и т. д. Возможно, с дополнительным отягощением.", R.drawable.otgim),
        Sport("Вис на турнике","Вертикальный вис на перекладине позволяет хорошо растянуть многочисленные плечевые мышцы, что увеличивает их гибкость, улучшает суставное движение и уменьшает мышечное напряжение. При выполнении жимов или отжиманий хорошая мобильность в плечевых суставах позволяет делать упражнение с большим диапазоном движения, что обуславливает более качественное прорабатывание мышц верхней части тела.", R.drawable.visnaturnike),
        Sport("Бурпи","Берпи (бурпи) — это плиометрическое упражнение, которое представляет собой сочетание планки, отжимания и прыжка. Это супер-эффективное упражнение включает в работу все мышцы вашего тела, быстро поднимает пульс до зоны жиросжигания и позволяет сжечь большое количество калорий за короткое время.", R.drawable.burpi),
        Sport("Планка","Планка для похудения живота — прекрасный вариант, она намного эффективнее, чем любые скручивания. Но здесь важно не забывать и о правильном питании. Любые усилия на тренировке могут пойти прахом, если не оставить привычку переедать, продолжать употреблять вредную пищу.", R.drawable.planka),
        Sport("Приседания","Приседа́ния — одно из базовых силовых упражнений (в том числе в пауэрлифтинге и культуризме); выполняющий упражнение приседает и затем встаёт, возвращаясь в положение стоя.", R.drawable.prised)
    )


}